<template>
	<view class="common-bg learn-id">
		<view class="h3">创建身份</view>
		<view class="content">用密码学中的非对称加密算法（RSA）和哈希散列算法（SHA-256）在区块链上随机创建的区块玩家身份。区块玩家的身份有二个元数据，一是区块玩家的私有秘钥（简称私钥),二是私钥通过密码学的算法推算出的区块玩家的地址，该地址既代表区块玩家的身份，又是数字货币GCN的转账地址，具有隐私性和抗碰撞性（唯一的身份/地址，不会出现第二个区块玩家具有相同的身份/地址）。区块玩家的身份/地址是用16进制的42位编码组成，均以0X开头。如0x8c75bc81434d17fba6994c30773bf8eabb509c81。区块玩家的身份/地址不便记忆，区块玩家系统创建了复制功能和生成二维码功能，为区块玩家提供了复制粘贴和扫描二维码的便捷使用。</view>
		<view class="h3">私钥和私钥助记词</view>
		<view class="content">区块玩家的私钥是区块链玩家创建身份时随机产生的数字编码，如果区块玩家的私钥泄露、丢失，区块玩家在区块链上的身份/地址、该身份/地址下的多链钱包、多链钱包中的资产将永久丢失，区块链系统无法找回这些资产。区块玩家的私钥是用16进制的64位编码组成，如18e14a7b6a307f42a94f8114701e7c8e774e7f9a47e2c2035db29a2063261725。私钥很难记忆，系统把私钥经过运算生成按照一定顺序排列的助记词。</view>
		<view class="h3">区块玩家的助记词 </view>
		<view class="content">是12个按顺序排列的英文单词，记忆了助记词就是记忆了私钥。为保证区块链玩家的资产安全，助记词需要区块玩家手动抄写到纸制介质上，或者形成文件，保存到一个不连接网络带有安全防范措施的存储介质中，如带密码的磁盘或者其他有管理权限的存储器。</view>
		<view class="content">区块玩家的助记词是重要的元数据，如果出现区块玩家系统的意外损坏，或者更换了新手机，可以使用记录的助记词用系统的恢复身份功能来恢复已有的身份，恢复该身份下的所有资产。</view>
		<view class="content">若助记词意外泄露，应迅速创建一个新的区块玩家身份，把原区块玩家身份下的多链钱包的数字资产转移到新区块玩家身份下，并记录好新的私钥助记词。</view>
		<view class="h3">密文</view>
		<view class="content">密文是区块链玩家在创建身份或恢复身份时输入的文字、数字。其他字符等组成的语句，
			密文是数字货币提币到交易所和区块玩家外部钱包时应输入的提币口令，所以要简短、易记，如“520区块玩家”。
			如果忘记密文的内容或者更换了新手机，可以使用私钥助记词和系统恢复身份的功能对密文进行重置。</view>
		<view class="h3">
			身份下多链钱包
		</view>
		<view class="content">
			区块玩家身份下的数字钱包可以支持比特币（BTC）、以太币（ETH）等数字货币，因为不同的数字货币运行在不同的区块链上，所以区块玩家身份下的钱包就是多链钱包。多链钱包能支持多种数字货币交易，在交易时同一条区块链上的钱包可以互相转账，如只能把比特币（BTC）钱包中的数字货币提币到比特币（BTC）钱包中，不能把比特币（BTC）钱包中的数字货币提币到以太币（ETH）钱包中，所以在区块链玩家系统中的充币和提币操作，一定要注意识别核对不用币种的钱包地址。
		</view>
	</view>
</template>

<script>
</script>

<style lang="scss">
	.learn-id{
		padding: 30rpx;
		overflow: auto;
		
		.h3{
			font-size: 32rpx;
			color: #353535;
			margin: 20rpx 0;
			font-weight: bold;
		}
		
		.content{
			color: #5F5F5F;
			font-size: 24rpx;
			text-indent: 40rpx;
		}
	}
</style>
